ferdiu/ESP32ProvisionToolkit/src/ESP32ProvisionToolkit.cpp
/*
 * ESP32ProvisionToolkit.cpp
 * Implementation of Wi-Fi provisioning and recovery system
 */

#include "ESP32ProvisionToolkit.h"
#include <esp_wifi.h>

// Static instance pointer for web server callbacks
ESP32ProvisionToolkit* ESP32ProvisionToolkit::_instance = nullptr;

// NVS namespace and keys
#define NVS_NAMESPACE "wifiprov"
#define NVS_SSID "ssid"
#define NVS_PASSWORD "password"
#define NVS_RESET_PWD "reset_pwd"
#define NVS_BOOT_COUNT "boot_count"
#define NVS_BOOT_TIME "boot_time"

ESP32ProvisionToolkit::ESP32ProvisionToolkit() :
    _state(STATE_INIT),
    _retryCount(0),
    _lastRetryTime(0),
    _apStartTime(0),
    _buttonPressStart(0),
    _buttonPressed(false),
    _dnsServer(nullptr),
    _webServer(nullptr),
    _onConnectedCallback(nullptr),
    _onFailedCallback(nullptr),
    _onAPModeCallback(nullptr),
    _onResetCallback(nullptr),
    _lastLedToggle(0),
    _ledState(false)
{
    _instance = this;
}

ESP32ProvisionToolkit::~ESP32ProvisionToolkit() {
    if (_dnsServer) delete _dnsServer;
    if (_webServer) delete _webServer;
    _instance = nullptr;
}

// ===== Configuration API =====

ESP32ProvisionToolkit& ESP32ProvisionToolkit::setAPName(const String& name) {
    _config.apName = name;
    return *this;
}

ESP32ProvisionToolkit& ESP32ProvisionToolkit::setAPPassword(const String& password) {
    _config.apPassword = password;
    return *this;
}

ESP32ProvisionToolkit& ESP32ProvisionToolkit::setAPTimeout(uint32_t milliseconds) {
    _config.apTimeout = milliseconds;
    return *this;
}

ESP32ProvisionToolkit& ESP32ProvisionToolkit::setMaxRetries(uint8_t retries) {
    _config.maxRetries = retries;
    return *this;
}

ESP32ProvisionToolkit& ESP32ProvisionToolkit::setRetryDelay(uint32_t milliseconds) {
    _config.retryDelay = milliseconds;
    return *this;
}

ESP32ProvisionToolkit& ESP32ProvisionToolkit::setAutoWipeOnMaxRetries(bool enable) {
    _config.autoWipeOnMaxRetries = enable;
    return *this;
}

ESP32ProvisionToolkit& ESP32ProvisionToolkit::enableHardwareReset(int8_t pin, uint32_t durationMs, bool activeLow) {
    _config.hardwareResetEnabled = true;
    _config.resetButtonPin = pin;
    _config.resetButtonDuration = durationMs;
    _config.resetButtonActiveLow = activeLow;

    pinMode(pin, activeLow ? INPUT_PULLUP : INPUT);

    return *this;
}

ESP32ProvisionToolkit& ESP32ProvisionToolkit::disableHardwareReset() {
    _config.hardwareResetEnabled = false;
    return *this;
}

ESP32ProvisionToolkit& ESP32ProvisionToolkit::enableHttpReset(bool enable) {
    _config.httpResetEnabled = enable;
    _config.httpResetAuthRequired = false;
    return *this;
}

ESP32ProvisionToolkit& ESP32ProvisionToolkit::enableAuthenticatedHttpReset(bool enable) {
    _config.httpResetEnabled = enable;
    _config.httpResetAuthRequired = enable;
    return *this;
}

ESP32ProvisionToolkit& ESP32ProvisionToolkit::setLed(int8_t pin, bool activeLow) {
    _config.ledEnabled = true;
    _config.ledPin = pin;
    _config.ledActiveLow = activeLow;

    pinMode(pin, OUTPUT);
    digitalWrite(pin, activeLow ? HIGH : LOW);

    return *this;
}

ESP32ProvisionToolkit& ESP32ProvisionToolkit::enableMDNS(const String& name) {
    _config.mdnsEnabled = true;
    _config.mdnsName = name;
    return *this;
}

ESP32ProvisionToolkit& ESP32ProvisionToolkit::enableDoubleRebootDetect(uint32_t windowMs) {
    _config.doubleRebootDetectEnabled = true;
    _config.doubleRebootWindow = windowMs;
    return *this;
}

ESP32ProvisionToolkit& ESP32ProvisionToolkit::setLogLevel(LogLevel level) {
    _config.logLevel = level;
    return *this;
}

ESP32ProvisionToolkit& ESP32ProvisionToolkit::onConnected(WiFiConnectedCallback callback) {
    _onConnectedCallback = callback;
    return *this;
}

ESP32ProvisionToolkit& ESP32ProvisionToolkit::onFailed(WiFiFailedCallback callback) {
    _onFailedCallback = callback;
    return *this;
}

ESP32ProvisionToolkit& ESP32ProvisionToolkit::onAPMode(APModeCallback callback) {
    _onAPModeCallback = callback;
    return *this;
}

ESP32ProvisionToolkit& ESP32ProvisionToolkit::onReset(ResetCallback callback) {
    _onResetCallback = callback;
    return *this;
}

// ===== Core Control =====

bool ESP32ProvisionToolkit::begin() {
    log(LOG_INFO, "WiFiProvisioner v%s starting...", WIFI_PROVISIONER_VERSION);

    // Check for double-reboot detection
    if (_config.doubleRebootDetectEnabled) {
        checkDoubleReboot();
    }

    // Load configuration
    _state = STATE_LOAD_CONFIG;
    return true;
}

void ESP32ProvisionToolkit::loop() {
    // Handle reset button
    if (_config.hardwareResetEnabled) {
        checkHardwareReset();
    }

    // Update LED
    if (_config.ledEnabled) {
        updateLED();
    }

    // State machine
    switch (_state) {
        case STATE_INIT:
            handleStateInit();
            break;

        case STATE_LOAD_CONFIG:
            handleStateLoadConfig();
            break;

        case STATE_CONNECTING:
            handleStateConnecting();
            break;

        case STATE_CONNECTED:
            handleStateConnected();
            break;

        case STATE_RETRY_WAIT:
            handleStateRetryWait();
            break;

        case STATE_PROVISIONING:
            handleStateProvisioning();
            break;

        case STATE_PROVISIONING_ACTIVE:
            handleStateProvisioningActive();
            break;
    }
}

void ESP32ProvisionToolkit::reset() {
    performReset("Programmatic reset");
}

// ===== Status Query =====

bool ESP32ProvisionToolkit::isConnected() const {
    return _state == STATE_CONNECTED && WiFi.status() == WL_CONNECTED;
}

bool ESP32ProvisionToolkit::isProvisioning() const {
    return _state == STATE_PROVISIONING || _state == STATE_PROVISIONING_ACTIVE;
}

ProvisionerState ESP32ProvisionToolkit::getState() const {
    return _state;
}

String ESP32ProvisionToolkit::getSSID() const {
    return _storedSSID;
}

IPAddress ESP32ProvisionToolkit::getLocalIP() const {
    return WiFi.localIP();
}

String ESP32ProvisionToolkit::getAPIP() const {
    return WiFi.softAPIP().toString();
}

// ===== Custom Route Introspection =====

bool ESP32ProvisionToolkit::hasCustomRoutes() const {
    return !_customRoutes.empty();
}

bool ESP32ProvisionToolkit::hasConnectedOnlyRoutes() const {
    for (const auto& route : _customRoutes) {
        if (route.scope == ROUTE_CONNECTED_ONLY) {
            return true;
        }
    }
    return false;
}

bool ESP32ProvisionToolkit::hasProvisioningOnlyRoutes() const {
    for (const auto& route : _customRoutes) {
        if (route.scope == ROUTE_PROVISIONING_ONLY) {
            return true;
        }
    }
    return false;
}

// ===== Manual Control =====

