ferdiu/ESP32ProvisionToolkit/src/ESP32ProvisionToolkit.cpp
bool ESP32ProvisionToolkit::setCredentials(const String& ssid, const String& password, bool reboot) {
    if (saveCredentials(ssid, password)) {
        log(LOG_INFO, "Credentials saved: %s", ssid.c_str());
        if (reboot) {
            delay(500);
            ESP.restart();
        }
        return true;
    }
    return false;
}

bool ESP32ProvisionToolkit::clearCredentials(bool reboot) {
    clearAllCredentials();
    log(LOG_INFO, "Credentials cleared");
    if (reboot) {
        delay(500);
        ESP.restart();
    }
    return true;
}

// ===== Storage =====

bool ESP32ProvisionToolkit::loadCredentials() {
    if (!_preferences.begin(NVS_NAMESPACE, true)) {
        log(LOG_ERROR, "Failed to open NVS");
        return false;
    }

    _storedSSID = _preferences.getString(NVS_SSID, "");
    _storedPassword = _preferences.getString(NVS_PASSWORD, "");

    _preferences.end();

    bool hasCredentials = _storedSSID.length() > 0;
    log(LOG_DEBUG, "Loaded credentials: SSID=%s, hasPassword=%d",
        _storedSSID.c_str(), _storedPassword.length() > 0);

    return hasCredentials;
}

bool ESP32ProvisionToolkit::saveCredentials(const String& ssid, const String& password) {
    if (!_preferences.begin(NVS_NAMESPACE, false)) {
        log(LOG_ERROR, "Failed to open NVS for writing");
        return false;
    }

    _preferences.putString(NVS_SSID, ssid);
    _preferences.putString(NVS_PASSWORD, password);

    _preferences.end();

    _storedSSID = ssid;
    _storedPassword = password;

    return true;
}

bool ESP32ProvisionToolkit::loadResetPassword() {
    if (!_preferences.begin(NVS_NAMESPACE, true)) {
        return false;
    }

    _resetPassword = _preferences.getString(NVS_RESET_PWD, "");
    _preferences.end();

    return _resetPassword.length() > 0;
}

bool ESP32ProvisionToolkit::saveResetPassword(const String& password) {
    if (!_preferences.begin(NVS_NAMESPACE, false)) {
        return false;
    }

    String hash = hashPassword(password);
    _preferences.putString(NVS_RESET_PWD, hash);
    _preferences.end();

    _resetPassword = hash;

    return true;
}

void ESP32ProvisionToolkit::clearAllCredentials() {
    if (_preferences.begin(NVS_NAMESPACE, false)) {
        _preferences.clear();
        _preferences.end();
    }

    _storedSSID = "";
    _storedPassword = "";
    _resetPassword = "";
}

// ===== State Machine =====

void ESP32ProvisionToolkit::handleStateInit() {
    _state = STATE_LOAD_CONFIG;
}

void ESP32ProvisionToolkit::handleStateLoadConfig() {
    if (loadCredentials()) {
        log(LOG_INFO, "Found stored credentials for: %s", _storedSSID.c_str());
        _retryCount = 0;
        _state = STATE_CONNECTING;
        setLEDPattern(100, 900); // Slow blink
    } else {
        log(LOG_INFO, "No credentials found, entering provisioning mode");
        _state = STATE_PROVISIONING;
    }
}

void ESP32ProvisionToolkit::handleStateConnecting() {
    if (connectToWiFi()) {
        log(LOG_INFO, "Connected to WiFi: %s", _storedSSID.c_str());
        log(LOG_INFO, "IP Address: %s", WiFi.localIP().toString().c_str());

        // Setup mDNS if enabled
        if (_config.mdnsEnabled) {
            if (MDNS.begin(_config.mdnsName.c_str())) {
                log(LOG_INFO, "mDNS responder started: %s.local", _config.mdnsName.c_str());
            }
        }

        _state = STATE_CONNECTED;
        setLEDPattern(0, 0); // Solid on

        // Start minimal web server if reset is enabled
        startConnectedWebServer();

        if (_onConnectedCallback) {
            _onConnectedCallback();
        }
    } else {
        _state = STATE_RETRY_WAIT;
        _lastRetryTime = millis();
    }
}

void ESP32ProvisionToolkit::handleStateConnected() {
    // Client handling
    if (_webServer) {
        _webServer->handleClient();
    }

    // Check if still connected
    if (WiFi.status() != WL_CONNECTED) {
        log(LOG_ERROR, "WiFi connection lost");
        _retryCount = 0;
        _state = STATE_CONNECTING;
        setLEDPattern(100, 900);
    }
}

void ESP32ProvisionToolkit::handleStateRetryWait() {
    if (millis() - _lastRetryTime >= _config.retryDelay) {
        _retryCount++;

        log(LOG_INFO, "Retry %d/%d", _retryCount, _config.maxRetries);

        if (_retryCount >= _config.maxRetries) {
            log(LOG_ERROR, "Max retries exceeded");

            if (_onFailedCallback) {
                _onFailedCallback(_retryCount);
            }

            if (_config.autoWipeOnMaxRetries) {
                log(LOG_INFO, "Auto-wiping credentials");
                clearAllCredentials();
                _state = STATE_PROVISIONING;
            } else {
                // Keep retrying
                _retryCount = 0;
                _state = STATE_CONNECTING;
            }
        } else {
            _state = STATE_CONNECTING;
        }
    }
}

void ESP32ProvisionToolkit::handleStateProvisioning() {
    startProvisioningMode();
    _state = STATE_PROVISIONING_ACTIVE;
}

void ESP32ProvisionToolkit::handleStateProvisioningActive() {
    // Handle DNS requests
    if (_dnsServer) {
        _dnsServer->processNextRequest();
    }

    // Handle web requests
    if (_webServer) {
        _webServer->handleClient();
    }

    // Check timeout
    if (_config.apTimeout > 0 && millis() - _apStartTime >= _config.apTimeout) {
        log(LOG_INFO, "AP timeout reached");
        stopProvisioningMode();

        // Retry connection if we have credentials
        if (_storedSSID.length() > 0) {
            _state = STATE_CONNECTING;
        }
    }
}

// ===== Connection =====

bool ESP32ProvisionToolkit::connectToWiFi() {
    WiFi.mode(WIFI_STA);
    WiFi.begin(_storedSSID.c_str(), _storedPassword.c_str());

    unsigned long startAttempt = millis();
    const unsigned long timeout = 10000; // 10 second timeout per attempt

    while (WiFi.status() != WL_CONNECTED && millis() - startAttempt < timeout) {
        delay(100);
    }

    return WiFi.status() == WL_CONNECTED;
}

void ESP32ProvisionToolkit::disconnectWiFi() {
    WiFi.disconnect(true);
    WiFi.mode(WIFI_OFF);
}

