ferdiu/ESP32ProvisionToolkit/src/ESP32ProvisionToolkit.cpp
// ===== Provisioning =====

void ESP32ProvisionToolkit::startProvisioningMode() {
    log(LOG_INFO, "Starting provisioning mode");

    // Stop any existing connection
    disconnectWiFi();

    // Stop any existing webserver
    stopWebServer();

    // Create unique AP name
    String apName = _config.apName + "-" + getMACAddress().substring(9);
    apName.replace(":", "");

    // Start AP
    WiFi.mode(WIFI_AP);

    if (_config.apPassword.length() >= 8) { // Valid password
        WiFi.softAP(apName.c_str(), _config.apPassword.c_str());
        log(LOG_INFO, "AP started: %s (password protected)", apName.c_str());
    } else if (_config.apPassword.length() >= 1) { // Password too short
        WiFi.softAP(apName.c_str());
        log(LOG_ERROR,
            "AP password too short (%d chars). WPA2 requires at least 8. Starting OPEN AP.",
            _config.apPassword.length());
    } else { // Open network
        WiFi.softAP(apName.c_str());
        log(LOG_INFO, "AP started: %s (open network)", apName.c_str());
    }

    IPAddress apIP = WiFi.softAPIP();
    log(LOG_INFO, "AP IP: %s", apIP.toString().c_str());

    // Start DNS server for captive portal
    if (!_dnsServer) {
        _dnsServer = new DNSServer();
    }
    _dnsServer->start(DNS_PORT, "*", apIP);

    // Load reset password if needed
    if (_config.httpResetAuthRequired) {
        loadResetPassword();
    }

    // Start web server
    setupWebServerProvisioningMode();

    _apStartTime = millis();
    setLEDPattern(100, 100); // Fast blink

    if (_onAPModeCallback) {
        _onAPModeCallback(apName.c_str(), apIP.toString().c_str());
    }
}

void ESP32ProvisionToolkit::stopProvisioningMode() {
    log(LOG_INFO, "Stopping provisioning mode");

    if (_dnsServer) {
        _dnsServer->stop();
    }

    stopWebServer();

    WiFi.softAPdisconnect(true);
}

void ESP32ProvisionToolkit::setupWebServerProvisioningMode() {
    if (!_webServer) {
        _webServer = new WebServer(WEB_SERVER_PORT);
    }

    _webServer->on("/", HTTP_GET, staticHandleRoot);
    _webServer->on("/scan", HTTP_GET, staticHandleScan);
    _webServer->on("/save", HTTP_POST, staticHandleSave);

    // This avoid captive portals redirect after form submission
    _webServer->on("/save", HTTP_GET, staticHandleSaveGet);

    if (_config.httpResetEnabled) {
        _webServer->on("/reset", HTTP_POST, staticHandleReset);
    }

    registerCustomRoutes(ROUTE_PROVISIONING_ONLY);

    _webServer->onNotFound(staticHandleNotFound);

    _webServer->begin();
    log(LOG_INFO, "Web server started on port %d", WEB_SERVER_PORT);
}

// ===== Web Server Handlers =====

void ESP32ProvisionToolkit::handleRoot() {
    String html = generateHTML();
    _webServer->send(200, "text/html", html);
}

void ESP32ProvisionToolkit::handleScan() {
    log(LOG_DEBUG, "Scanning for networks...");

    int n = WiFi.scanNetworks();
    String json = "[";

    for (int i = 0; i < n; i++) {
        if (i > 0) json += ",";
        json += "{";
        json += "\"ssid\":\"" + WiFi.SSID(i) + "\",";
        json += "\"rssi\":" + String(WiFi.RSSI(i)) + ",";
        json += "\"secure\":" + String(WiFi.encryptionType(i) != WIFI_AUTH_OPEN ? "true" : "false");
        json += "}";
    }

    json += "]";

    WiFi.scanDelete();

    _webServer->send(200, "application/json", json);
}

void ESP32ProvisionToolkit::handleSave() {
    String ssid = _webServer->arg("ssid");
    String password = _webServer->arg("password");
    String resetPwd = _webServer->arg("reset_password");

    log(LOG_INFO, "Received configuration: SSID=%s", ssid.c_str());

    if (ssid.length() == 0) {
        _webServer->send(400, "text/plain", "SSID is required");
        return;
    }

    // Save WiFi credentials
    if (!saveCredentials(ssid, password)) {
        _webServer->send(500, "text/plain", "Failed to save credentials");
        return;
    }

    // Save reset password if authentication is enabled
    if (_config.httpResetAuthRequired && resetPwd.length() > 0) {
        saveResetPassword(resetPwd);
    }

    _webServer->send(200, "text/plain", "Configuration saved. Rebooting...");

    log(LOG_INFO, "Configuration saved, rebooting in 2 seconds");
    delay(2000);
    ESP.restart();
}

void ESP32ProvisionToolkit::handleSaveGet() {
    log(LOG_INFO, "Sending saved status to the client");
    _webServer->send(200, "text/plain", "OK");
}

void ESP32ProvisionToolkit::handleReset() {
    if (!_config.httpResetEnabled) {
        _webServer->send(403, "text/plain", "Reset disabled");
        return;
    }

    // Check authentication if required
    if (_config.httpResetAuthRequired) {
        String password = _webServer->arg("password");

        if (password.length() == 0) {
            _webServer->send(401, "text/plain", "Password required");
            return;
        }

        if (!verifyPassword(password, _resetPassword)) {
            log(LOG_ERROR, "Reset authentication failed");
            _webServer->send(401, "text/plain", "Invalid password");
            return;
        }
    }

    log(LOG_INFO, "HTTP reset triggered");

    _webServer->send(200, "text/plain", "Resetting device...");

    delay(1000);
    performReset("HTTP reset");
}

void ESP32ProvisionToolkit::handleNotFound() {
    log(LOG_DEBUG, "NotFound: %s %s",
        _webServer->method() == HTTP_GET ? "GET" : "POST",
        _webServer->uri().c_str());

    // Captive portal redirect
    _webServer->sendHeader("Location", "/", true);
    _webServer->send(302, "text/plain", "");
}

// Static web server handlers
void ESP32ProvisionToolkit::staticHandleRoot() {
    if (_instance) _instance->handleRoot();
}

void ESP32ProvisionToolkit::staticHandleScan() {
    if (_instance) _instance->handleScan();
}

void ESP32ProvisionToolkit::staticHandleSave() {
    if (_instance) _instance->handleSave();
}

void ESP32ProvisionToolkit::staticHandleSaveGet() {
    if (_instance) _instance->handleSaveGet();
}

void ESP32ProvisionToolkit::staticHandleReset() {
    if (_instance) _instance->handleReset();
}

void ESP32ProvisionToolkit::staticHandleNotFound() {
    if (_instance) _instance->handleNotFound();
}

// ===== Reset Mechanisms =====

void ESP32ProvisionToolkit::checkHardwareReset() {
    bool buttonState = digitalRead(_config.resetButtonPin);
    bool isPressed = _config.resetButtonActiveLow ? (buttonState == LOW) : (buttonState == HIGH);

    if (isPressed && !_buttonPressed) {
        // Button just pressed
        _buttonPressed = true;
        _buttonPressStart = millis();
    } else if (isPressed && _buttonPressed) {
        // Button still pressed, check duration
        if (millis() - _buttonPressStart >= _config.resetButtonDuration) {
            log(LOG_INFO, "Hardware reset button held for %lu ms", _config.resetButtonDuration);
            performReset("Hardware button");
        }
    } else if (!isPressed && _buttonPressed) {
        // Button released before threshold
        _buttonPressed = false;
    }
}

void ESP32ProvisionToolkit::checkDoubleReboot() {
    if (!_preferences.begin(NVS_NAMESPACE, false)) {
        return;
    }

