ferdiu/ESP32ProvisionToolkit/src/ESP32ProvisionToolkit.cpp
    uint32_t bootCount = _preferences.getUInt(NVS_BOOT_COUNT, 0);
    uint32_t lastBootTime = _preferences.getUInt(NVS_BOOT_TIME, 0);
    uint32_t currentTime = millis();

    bootCount++;
    _preferences.putUInt(NVS_BOOT_COUNT, bootCount);
    _preferences.putUInt(NVS_BOOT_TIME, currentTime);

    log(LOG_DEBUG, "Boot count: %u, last boot: %u ms ago", bootCount, currentTime - lastBootTime);

    // Check if this is a double reboot
    if (bootCount >= 2 && (currentTime - lastBootTime) < _config.doubleRebootWindow) {
        log(LOG_INFO, "Double reboot detected, clearing credentials");
        clearAllCredentials();
        _preferences.putUInt(NVS_BOOT_COUNT, 0);
    }

    _preferences.end();

    // Schedule boot count reset
    // This would normally be done with a timer, but we'll handle it in the main loop
}

void ESP32ProvisionToolkit::performReset(const char* reason) {
    log(LOG_INFO, "Performing reset: %s", reason);

    if (_onResetCallback) {
        _onResetCallback();
    }

    clearAllCredentials();
    delay(500);
    ESP.restart();
}

// ===== Web server controls =====

void ESP32ProvisionToolkit::startConnectedWebServer() {
    bool hasCustomRoutes = hasConnectedOnlyRoutes();

    // Only start if software reset is enabled
    if (!_config.httpResetEnabled && !hasCustomRoutes) {
        log(LOG_DEBUG, "HTTP reset disabled and no custom routes provided, not starting connected web server");
        return;
    }

    if (_webServer) {
        return; // Already running
    }

    // Load reset password if needed
    if (_config.httpResetAuthRequired) {
        loadResetPassword();
    }

    _webServer = new WebServer(WEB_SERVER_PORT);

    log(LOG_DEBUG, "Starting HTTP server for ConnectedMode...");

    // Reset endpoint
    if (_config.httpResetEnabled) {
        _webServer->on("/reset", HTTP_POST, staticHandleReset);
    }

    if (hasCustomRoutes) {
        registerCustomRoutes(ROUTE_CONNECTED_ONLY);
    }

    _webServer->begin();

    log(LOG_INFO, "Connected-mode web server started on port %d", WEB_SERVER_PORT);
}

void ESP32ProvisionToolkit::stopWebServer() {
    if (_webServer) {
        _webServer->stop();
        delete _webServer;
        _webServer = nullptr;
        log(LOG_DEBUG, "Web server stopped");
    }
}

// ===== UX =====

void ESP32ProvisionToolkit::updateLED() {
    // LED is controlled by pattern set in setLEDPattern
    // This is a simple implementation; could be enhanced with more patterns

    static uint32_t onTime = 0;
    static uint32_t offTime = 0;

    if (_state == STATE_PROVISIONING || _state == STATE_PROVISIONING_ACTIVE) {
        onTime = 100;
        offTime = 100;
    } else if (_state == STATE_CONNECTING || _state == STATE_RETRY_WAIT) {
        onTime = 100;
        offTime = 900;
    } else if (_state == STATE_CONNECTED) {
        onTime = 0;
        offTime = 0;
        digitalWrite(_config.ledPin, _config.ledActiveLow ? LOW : HIGH);
        return;
    } else {
        digitalWrite(_config.ledPin, _config.ledActiveLow ? HIGH : LOW);
        return;
    }

    unsigned long now = millis();
    uint32_t period = onTime + offTime;

    if (period == 0) {
        // Solid on
        digitalWrite(_config.ledPin, _config.ledActiveLow ? LOW : HIGH);
        return;
    }

    unsigned long phase = now % period;
    bool shouldBeOn = phase < onTime;

    if (shouldBeOn) {
        digitalWrite(_config.ledPin, _config.ledActiveLow ? LOW : HIGH);
    } else {
        digitalWrite(_config.ledPin, _config.ledActiveLow ? HIGH : LOW);
    }
}

void ESP32ProvisionToolkit::setLEDPattern(uint32_t onTime, uint32_t offTime) {
    // This is handled directly in updateLED for simplicity
    // A more sophisticated implementation would store patterns
}

// ===== Custom routes =====

void ESP32ProvisionToolkit::registerCustomRoutes(HttpRouteScope activeScope) {
    if (!_webServer) return;

    for (const auto& route : _customRoutes) {
        if (route.scope != activeScope && route.scope != ROUTE_BOTH) {
            continue;
        }

        _webServer->on(
            route.path.c_str(),
            route.method,
            [this, route]() {

                // Optional authentication
                if (route.requiresAuth) {
                    if (!_config.httpResetAuthRequired) {
                        _webServer->send(403, "text/plain", "Authentication required");
                        return;
                    }

                    String pwd = _webServer->arg("password");
                    if (!verifyPassword(pwd, _resetPassword)) {
                        _webServer->send(401, "text/plain", "Invalid password");
                        return;
                    }
                }

                // Call user handler
                route.handler(*_webServer);
            }
        );
    }
}

ESP32ProvisionToolkit& ESP32ProvisionToolkit::addHttpRoute(
    const String& path,
    HTTPMethod method,
    HttpRouteHandler handler,
    HttpRouteScope scope,
    bool requiresAuth
) {
    _customRoutes.push_back({
        path,
        method,
        handler,
        scope,
        requiresAuth
    });

    log(LOG_DEBUG, "Custom route registered: %s", path.c_str());
    return *this;
}

ESP32ProvisionToolkit& ESP32ProvisionToolkit::addGet(
    const String& path,
    HttpRouteHandler handler,
    HttpRouteScope scope,
    bool requiresAuth
) {
    return addHttpRoute(path, HTTP_GET, handler, scope, requiresAuth);
}

ESP32ProvisionToolkit& ESP32ProvisionToolkit::addPost(
    const String& path,
    HttpRouteHandler handler,
    HttpRouteScope scope,
    bool requiresAuth
) {
    return addHttpRoute(path, HTTP_POST, handler, scope, requiresAuth);
}

ESP32ProvisionToolkit& ESP32ProvisionToolkit::addJsonRoute(
    const String& path,
    HTTPMethod method,
    std::function<String()> jsonProvider,
    HttpRouteScope scope,
    bool requiresAuth
) {
    return addHttpRoute(
        path,
        method,
        [jsonProvider](WebServer& s) {
            s.send(200, "application/json", jsonProvider());
        },
        scope,
        requiresAuth
    );
}

ESP32ProvisionToolkit& ESP32ProvisionToolkit::addGetJsonRoute(
    const String& path,
    std::function<String()> jsonProvider,
    HttpRouteScope scope,
    bool requiresAuth
) {
    return addJsonRoute(path, HTTP_GET, jsonProvider, scope, requiresAuth);
}

ESP32ProvisionToolkit& ESP32ProvisionToolkit::addPostJsonRoute(
    const String& path,
    std::function<String()> jsonProvider,
    HttpRouteScope scope,
    bool requiresAuth
) {
    return addJsonRoute(path, HTTP_POST, jsonProvider, scope, requiresAuth);
}

// ===== Utilities =====

void ESP32ProvisionToolkit::log(LogLevel level, const char* format, ...) {
    if (level > _config.logLevel) return;

    const char* levelStr;
    switch (level) {
        case LOG_ERROR: levelStr = "ERROR"; break;
        case LOG_INFO:  levelStr = "INFO "; break;
        case LOG_DEBUG: levelStr = "DEBUG"; break;
        default:        levelStr = "     "; break;
    }

    char buffer[256];
    va_list args;
    va_start(args, format);
    vsnprintf(buffer, sizeof(buffer), format, args);
    va_end(args);

