ferdiu/ESP32ProvisionToolkit/src/ESP32ProvisionToolkit.cpp
            <form id="configForm" onsubmit="return saveConfig(event);">
                <div class="form-group">
                    <label for="ssid">Network Name (SSID)</label>
                    <input type="text" id="ssid" name="ssid" required placeholder="Enter or select network">
                </div>

                <div class="form-group">
                    <label for="password">Password</label>
                    <input type="password" id="password" name="password" placeholder="Leave blank for open networks">
                </div>

)";

    // Add reset password field if authentication is enabled
    if (_config.httpResetAuthRequired) {
        html += R"(
                <button type="button" class="toggle-advanced" onclick="toggleAdvanced();">Advanced Options</button>

                <div id="advanced" class="advanced hidden">
                    <div class="form-group">
                        <label for="reset_password">Reset Password (Optional)</label>
                        <input type="password" id="reset_password" name="reset_password" placeholder="For remote device reset">
                    </div>
                </div>
)";
    }

    html += R"(
                <button type="submit" id="submitBtn">Save Configuration</button>
            </form>
        </div>
    </div>

    <script>
        let networks = [];

        function showStatus(message, type) {
            const status = document.getElementById('status');
            status.textContent = message;
            status.className = 'status ' + type;
            status.classList.remove('hidden');
        }

        function hideStatus() {
            document.getElementById('status').classList.add('hidden');
        }

        function toggleAdvanced() {
            const advanced = document.getElementById('advanced');
            advanced.classList.toggle('hidden');
        }

        function scanNetworks() {
            showStatus('Scanning for networks...', 'info');

            fetch('/scan')
                .then(response => response.json())
                .then(data => {
                    networks = data;
                    displayNetworks(data);
                    hideStatus();
                })
                .catch(error => {
                    showStatus('Scan failed. Please try again.', 'error');
                });
        }

        function displayNetworks(networks) {
            const container = document.getElementById('networks');

            if (networks.length === 0) {
                container.innerHTML = '<div class="network-item">No networks found</div>';
            } else {
                container.innerHTML = networks.map((network, index) => {
                    const signal = network.rssi;
                    const bars = signal > -50 ? '▂▄▆█' : signal > -60 ? '▂▄▆' : signal > -70 ? '▂▄' : '▂';
                    const lock = network.secure ? '<span class="lock-icon"></span>' : '';

                    return `
                        <div class="network-item" onclick="selectNetwork(${index});">
                            <span>${network.ssid}</span>
                            <span class="signal">${bars} ${lock}</span>
                        </div>
                    `;
                }).join('');
            }

            container.classList.remove('hidden');
        }

        function selectNetwork(index) {
            const network = networks[index];
            document.getElementById('ssid').value = network.ssid;

            // Highlight selected
            document.querySelectorAll('.network-item').forEach((item, i) => {
                if (i === index) {
                    item.classList.add('selected');
                } else {
                    item.classList.remove('selected');
                }
            });

            // Focus password field
            document.getElementById('password').focus();
        }

        function saveConfig(event) {
            // Prevent the form to trigger default behaviour (pt. 1)
            event.preventDefault();

            const formData = new FormData(event.target);
            const submitBtn = document.getElementById('submitBtn');

            submitBtn.disabled = true;
            submitBtn.textContent = 'Saving...';
            showStatus('Saving configuration...', 'info');

            fetch('/save', {
                method: 'POST',
                body: new URLSearchParams(formData)
            })
            .then(response => {
                if (response.ok) {
                    showStatus('Configuration saved! Device is rebooting...', 'success');
                    setTimeout(() => {
                        showStatus('You can close this page and reconnect to your network.', 'info');
                    }, 3000);
                } else {
                    throw new Error('Save failed');
                }
            })
            .catch(error => {
                showStatus('Failed to save configuration. Please try again.', 'error');
                submitBtn.disabled = false;
                submitBtn.textContent = 'Save Configuration';
            });

            // Prevent the form to trigger default behaviour (pt. 2)
            return false;
        }

        // Auto-scan on load
        window.addEventListener('load', function() {
            setTimeout(scanNetworks, 500);
        });
    </script>
</body>
</html>
)";

    return html;
}